---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuiltInFailures..::..InterferenceFailures Members
BuiltInFailures..::..InterferenceFailures Class Properties See Also Send Feedback
---

Provides a container of all Revit built-in FailureDefinitionId instances.

The BuiltInFailures..::..InterferenceFailures type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | GeometryWarning | A geometrical error has occurred while checking for Interference. Reported interference may not be accurate. |

# See Also

BuiltInFailures..::..InterferenceFailures Class

Autodesk.Revit.DB Namespace